app/views/messages/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
messages of <%= User.find_by_id(@connection.user_one_id).username %> and <%= User.find_by_id(@connection.user_two_id).username %>