app/views/users/index.html.erb


			<% if Follow.find_by_fan_id_and_star_id(user.id, session["user_id"]).present? && Follow.find_by_star_id_and_fan_id(user.id, session["user_id"]).present?  %>
---
SELECT  "follows".* FROM "follows" WHERE "follows"."star_id" = ? AND "follows"."fan_id" = ? LIMIT 1  [["star_id", 2], ["fan_id", 3]]