app/views/follows/index.html.erb

SELECT "follows".id FROM "follows" WHERE "follows"."fan_id" = ?  [["fan_id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
<div class="col-xs-6">
	<% user_id = Follow.find_by(:id => follower_id).fan_id %>
	<%= User.find_by(:id => user_id).username %>