app/controllers/follows_controller.rb

	def index
		@user = User.find_by(:id => params["user_id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]

	def create
		@user = User.find_by(:id => params["user_id"])
		follow = Follow.new
		follow.star_id = params["user_id"]
		follow.fan_id = session["user_id"]
		if follow.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "follows" ("star_id", "fan_id") VALUES (?, ?)  [["star_id", 1], ["fan_id", 3]]

	def destroy
		@user = User.find_by(:id => params["user_id"])
		Follow.find_by_id(params["id"]).delete
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "follows" WHERE "follows"."id" = ?  [["id", 6]]
SELECT  "follows".* FROM "follows" WHERE "follows"."id" = ? LIMIT 1  [["id", 6]]