app/controllers/messages_controller.rb

	def index
		@user = User.find_by_id(session["user_id"])
		@connection = Connection.find_by_id(params["connection_id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "connections".* FROM "connections" WHERE "connections"."id" = ? LIMIT 1  [["id", 1]]