app/controllers/tweets_controller.rb

	def destroy
		Tweet.find_by(id: params["id"]).delete
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", 7]]

	def update
		tweet = Tweet.find_by(id: params["id"])
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", 5]]