app/controllers/tweets_controller.rb

	def index
		if params["user_id"].present?
			@tweets = Tweet.where(user_id: params["user_id"]).limit(100)
		else
			@tweets = Tweet.all.limit(100)
		end
		@tweets = @tweets.order('date desc').paginate(:per_page => 5, :page => params[:page])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 3]]
SELECT "tweets".* FROM "tweets"  ORDER BY date desc
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ?  ORDER BY date desc LIMIT 5 OFFSET 0  [["user_id", 3]]
SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 3]]

	def show
		@tweet = Tweet.find_by(id: params["id"])
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", 5]]

	def create
		tweet = Tweet.new
		tweet.content = params[:post_tweet]
		tweet.date = DateTime.now.to_i
		tweet.user_id = session["user_id"]
		tweet.save
---
INSERT INTO "tweets" ("content", "date", "user_id") VALUES (?, ?, ?)  [["content", "new tweet"], ["date", 1431906470], ["user_id", 3]]

	def destroy
		@tweet.delete
---
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 7]]

	def edit
		@tweet = Tweet.find_by(id: params["id"])
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", 5]]

	def update
		@tweet.content = params["update_tweet"]
		@tweet.image = params["image"]
		@tweet.date = DateTime.now.to_i
		@tweet.save
---
UPDATE "tweets" SET "content" = ?, "image" = ?, "date" = ? WHERE "tweets"."id" = ?  [["content", nil], ["image", "http://ww4.sinaimg.cn/square/576f539ejw1epsk493ua5j21jk0v9wzh.jpg"], ["date", 1431925042], ["id", 5]]